dogusyuksel/ti_cc2640r2f_sdk/ccs1281/ccs/ccs_base/common/targetdb/Modules/msp/mspm0gx51x/SPI1_1.0.xml
<?xml version="1.0" encoding="UTF-8"?>
<module id="SPI1" HW_revision="1.0">
    <group id="SPI1_GPRCM" name="SPI1_GPRCM" instances="1" offset="0x800" instaddr="0x100" description="">
        <register id="SPI1_PWREN" width="32" offset="0x0" description="Power enable">
            <bitfield id="ENABLE" description="Enable the power" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="Disable Power"/>
                <bitenum id="ENABLE" value="0x1" description="Enable Power"/>
            </bitfield>
        </register>
        <register id="SPI1_RSTCTL" width="32" offset="0x4" description="Reset Control">
            <bitfield id="RESETSTKYCLR" description="Clear the RESETSTKY bit in the STAT register" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="NOP" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="Clear reset sticky bit"/>
            </bitfield>
            <bitfield id="RESETASSERT" description="Assert reset to the peripheral" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NOP" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="ASSERT" value="0x1" description="Assert reset"/>
            </bitfield>
        </register>
        <register id="SPI1_CLKCFG" width="32" offset="0x8" description="Peripheral Clock Configuration Register">
            <bitfield id="BLOCKASYNC" description="Async Clock Request is blocked from starting SYSOSC or forcing bus clock to 32MHz" begin="8" end="8" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="Not block async clock request"/>
                <bitenum id="ENABLE" value="0x1" description="Block async clock request"/>
            </bitfield>
        </register>
        <register id="SPI1_GPRCM_STAT" width="32" offset="0x14" description="Status Register">
            <bitfield id="RESETSTKY" description="This bit indicates, if the peripheral was reset, since this bit was cleared by RESETSTKYCLR in the RSTCTL register" begin="16" end="16" width="1" rwaccess="R">
                <bitenum id="NORES" value="0x0" description="The peripheral has not been reset since this bit was last cleared by RESETSTKYCLR in the RSTCTL register"/>
                <bitenum id="RESET" value="0x1" description="The peripheral was reset since the last bit clear"/>
            </bitfield>
        </register>
        </group>
    <register id="SPI1_CLKDIV" width="32" offset="0x1000" description="Clock Divider">
        <bitfield id="RATIO" description="Selects divide ratio of module clock" begin="2" end="0" width="3" rwaccess="R/W">
            <bitenum id="DIV_BY_1" value="0x0" description="Do not divide clock source"/>
            <bitenum id="DIV_BY_2" value="0x1" description="Divide clock source by 2"/>
            <bitenum id="DIV_BY_3" value="0x2" description="Divide clock source by 3"/>
            <bitenum id="DIV_BY_4" value="0x3" description="Divide clock source by 4"/>
            <bitenum id="DIV_BY_5" value="0x4" description="Divide clock source by 5"/>
            <bitenum id="DIV_BY_6" value="0x5" description="Divide clock source by 6"/>
            <bitenum id="DIV_BY_7" value="0x6" description="Divide clock source by 7"/>
            <bitenum id="DIV_BY_8" value="0x7" description="Divide clock source by 8"/>
        </bitfield>
    </register>
    <register id="SPI1_CLKSEL" width="32" offset="0x1004" description="Clock Select for Ultra Low Power peripherals">
        <bitfield id="LFCLK_SEL" description="Selects LFCLK as clock source if enabled" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Does not select this clock as a source"/>
            <bitenum id="ENABLE" value="0x1" description="Select this clock as a source"/>
        </bitfield>
        <bitfield id="MFCLK_SEL" description="Selects MFCLK as clock source if enabled" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Does not select this clock as a source"/>
            <bitenum id="ENABLE" value="0x1" description="Select this clock as a source"/>
        </bitfield>
        <bitfield id="SYSCLK_SEL" description="Selects SYSCLK as clock source if enabled" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Does not select this clock as a source"/>
            <bitenum id="ENABLE" value="0x1" description="Select this clock as a source"/>
        </bitfield>
    </register>
    <register id="SPI1_PDBGCTL" width="32" offset="0x1018" description="Peripheral Debug Control">
        <bitfield id="FREE" description="Free run control" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="STOP" value="0x0" description="The peripheral freezes functionality while the Core Halted input is asserted and resumes when it is deasserted."/>
            <bitenum id="RUN" value="0x1" description="The peripheral ignores the state of the Core Halted input"/>
        </bitfield>
        <bitfield id="SOFT" description="Soft halt boundary control. This function is only available, if [FREE] is set to 'STOP'" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="IMMEDIATE" value="0x0" description="The peripheral will halt immediately, even if the resultant state will result in corruption if the system is restarted"/>
            <bitenum id="DELAYED" value="0x1" description="The peripheral blocks the debug freeze until it has reached a boundary where it can resume without corruption"/>
        </bitfield>
    </register>
    <group id="SPI1_CPU_INT" name="SPI1_CPU_INT" instances="1" offset="0x1020" instaddr="0x30" description="">
        <register id="SPI1_CPU_INT_IIDX" width="32" offset="0x0" description="Interrupt Index Register">
            <bitfield id="STAT" description="Interrupt index status" begin="7" end="0" width="8" rwaccess="R">
                <bitenum id="NO_INTR" value="0x0" description="No interrupt pending"/>
                <bitenum id="RXFIFO_OFV_EVT" value="0x1" description="RX FIFO Overflow Event/interrupt pending"/>
                <bitenum id="PER_EVT" value="0x2" description="Transmit Parity Event/interrupt pending"/>
                <bitenum id="RTOUT_EVT" value="0x3" description="SPI receive time-out interrupt"/>
                <bitenum id="RX_EVT" value="0x4" description="Receive Event/interrupt pending"/>
                <bitenum id="TX_EVT" value="0x5" description="Transmit Event/interrupt pending"/>
                <bitenum id="TX_EMPTY" value="0x6" description="Transmit Buffer Empty Event/interrupt pending"/>
                <bitenum id="IDLE_EVT" value="0x7" description="End of Transmit Event/interrupt pending"/>
                <bitenum id="DMA_DONE_RX_EVT" value="0x8" description="DMA Done for Receive Event/interrupt pending"/>
                <bitenum id="DMA_DONE_TX_EVT" value="0x9" description="DMA Done for Transmit Event/interrupt pending"/>
                <bitenum id="TXFIFO_UNF_EVT" value="0xA" description="TX FIFO underflow interrupt"/>
                <bitenum id="RXFULL_EVT" value="0xB" description="RX FIFO Full Interrupt"/>
            </bitfield>
        </register>
