dogusyuksel/ti_cc2640r2f_sdk/ccs1281/ccs/ccs_base/common/targetdb/Modules/msp/mspm0gx51x/SPI1_1.0.xml
        <register id="SPI1_CPU_INT_ICLR" width="32" offset="0x28" description="Interrupt clear">
            <bitfield id="RX" description="Clear Receive FIFO event." begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="Clear Interrupt"/>
            </bitfield>
            <bitfield id="TX" description="Clear Transmit FIFO event." begin="4" end="4" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="Clear Interrupt"/>
            </bitfield>
            <bitfield id="TXEMPTY" description="Clear Transmit FIFO Empty event." begin="5" end="5" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="Clear Interrupt"/>
            </bitfield>
            <bitfield id="PER" description="Clear Parity error event." begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="Clear Interrupt"/>
            </bitfield>
            <bitfield id="DMA_DONE_RX" description="Clear DMA Done 1 event for RX." begin="7" end="7" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="Clear Interrupt"/>
            </bitfield>
            <bitfield id="RXFIFO_OVF" description="Clear RXFIFO overflow event." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="Clear Interrupt"/>
            </bitfield>
            <bitfield id="DMA_DONE_TX" description="Clear DMA Done 1 event for TX." begin="8" end="8" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="Clear Interrupt"/>
            </bitfield>
            <bitfield id="IDLE" description="Clear SPI IDLE mode event." begin="6" end="6" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="Clear Interrupt"/>
            </bitfield>
            <bitfield id="RTOUT" description="Clear SPI Receive Time-Out Event." begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="TXFIFO_UNF" description="Clear TXFIFO underflow event" begin="9" end="9" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing has no effect"/>
                <bitenum id="CLR" value="0x1" description="Clear interrupt"/>
            </bitfield>
            <bitfield id="RXFULL" description="Clear RX FIFO underflow event" begin="10" end="10" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing has no effect"/>
                <bitenum id="CLR" value="0x1" description="Clear interrupt"/>
            </bitfield>
        </register>
        </group>
    <group id="SPI1_DMA_TRIG_RX" name="SPI1_DMA_TRIG_RX" instances="1" offset="0x1050" instaddr="0x30" description="">
        <register id="SPI1_DMA_TRIG_RX_IIDX" width="32" offset="0x0" description="Interrupt Index Register">
            <bitfield id="STAT" description="Interrupt index status" begin="7" end="0" width="8" rwaccess="R">
                <bitenum id="NO_INTR" value="0x0" description="No interrupt pending"/>
                <bitenum id="RTOUT_EVT" value="0x3" description="SPI receive time-out interrupt"/>
                <bitenum id="RX_EVT" value="0x4" description="Receive Event/interrupt pending"/>
            </bitfield>
        </register>
        <register id="SPI1_DMA_TRIG_RX_IMASK" width="32" offset="0x8" description="Interrupt mask">
            <bitfield id="RX" description="Receive FIFO event mask." begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="RTOUT" description="SPI Receive Time-Out event mask." begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
        </register>
        <register id="SPI1_DMA_TRIG_RX_RIS" width="32" offset="0x10" description="Raw interrupt status">
            <bitfield id="RX" description="Receive FIFO event.This interrupt is set if the selected Receive FIFO level has been reached" begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occurred"/>
            </bitfield>
            <bitfield id="RTOUT" description="SPI Receive Time-Out Event." begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
        </register>
        <register id="SPI1_DMA_TRIG_RX_MIS" width="32" offset="0x18" description="Masked interrupt status">
            <bitfield id="RX" description="Receive FIFO event mask." begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occurred"/>
            </bitfield>
            <bitfield id="RTOUT" description="SPI Receive Time-Out event mask." begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
        </register>
        <register id="SPI1_DMA_TRIG_RX_ISET" width="32" offset="0x20" description="Interrupt set">
            <bitfield id="RX" description="Set Receive FIFO event." begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt"/>
            </bitfield>
            <bitfield id="RTOUT" description="Set SPI Receive Time-Out event." begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
        </register>
        <register id="SPI1_DMA_TRIG_RX_ICLR" width="32" offset="0x28" description="Interrupt clear">
            <bitfield id="RX" description="Clear Receive FIFO event." begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="Clear Interrupt"/>
            </bitfield>
            <bitfield id="RTOUT" description="Clear SPI Receive Time-Out event." begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
        </register>
