dogusyuksel/ti_cc2640r2f_sdk/ccs1281/ccs/ccs_base/common/targetdb/Modules/msp/mspm0gx51x/SPI1_1.0.xml
    <register id="SPI1_CTL1" width="32" offset="0x1104" description="SPI control register 1">
        <bitfield id="LBM" description="Loop back mode" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disable loopback mode"/>
            <bitenum id="ENABLE" value="0x1" description="Enable loopback mode"/>
        </bitfield>
        <bitfield id="CP" description="Controller or peripheral mode select. This bit can be modified only when SPI is disabled, CTL1.ENABLE=0." begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Select Peripheral mode"/>
            <bitenum id="ENABLE" value="0x1" description="Select Controller Mode"/>
        </bitfield>
        <bitfield id="POD" description="Peripheral-mode: Data output disabled
This bit is relevant only in Peripheral mode. In multiple-peripheral system topologies, SPI controller can broadcast a message to all peripherals, while only one peripheral drives the line. 
POD can be used by the SPI peripheral to disable driving data on the line." begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPI can drive the MISO output in peripheral mode."/>
            <bitenum id="ENABLE" value="0x1" description="SPI cannot drive the MISO output in peripheral mode."/>
        </bitfield>
        <bitfield id="MSB" description="MSB first select. Controls the direction of the receive and transmit shift register." begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="LSB first"/>
            <bitenum id="ENABLE" value="0x1" description="MSB first"/>
        </bitfield>
        <bitfield id="PREN" description="Parity receive enable
If enabled, parity reception check will be done for both controller and peripheral modes
In case of a parity miss-match the parity error flag RIS.PER will be set." begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disable Parity receive function"/>
            <bitenum id="ENABLE" value="0x1" description="Enable Parity receive function"/>
        </bitfield>
        <bitfield id="REPEATTX" description="Counter to repeat last transfer
0: repeat last transfer is disabled.
x: repeat the last transfer with the given number.
The transfer will be started with writing a data into the TX Buffer. Sending the data will be repeated with the given value, so the data will be transferred X+1 times in total.
The behavior is identical as if the data would be written into the TX Buffer that many times as defined by the value here.
It can be used to clean a transfer or to pull a certain amount of data by a peripheral." begin="23" end="16" width="8" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="REPEATTX disable"/>
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="PES" description="Even Parity Select" begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Odd Parity mode"/>
            <bitenum id="ENABLE" value="0x1" description="Even Parity mode"/>
        </bitfield>
        <bitfield id="CDMODE" description="Command/Data Mode Value

When CTL1.CDENABLE is 1, CS3 line is used as C/D signal to distinguish between Command (C/D low) and Data (C/D high) information.

When a value is written into the CTL1.CDMODE bits, the C/D (CS3) line will go low for the given numbers of byte which are sent by the SPI, starting with the next value to be transmitted after which, C/D line will go high automatically

0: Manual mode with C/D signal as High
1-14: C/D is low while this number of bytes are being sent after which, this field sets to 0 and C/D goes high. Reading this field at any time returns the remaining number of command bytes.
15: Manual mode with C/D signal as Low." begin="15" end="12" width="4" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="DATA" value="0x0" description="Manual mode: Data"/>
            <bitenum id="MAXIMUM" value="0xF" description="Highest possible value"/>
            <bitenum id="COMMAND" value="0xF" description="Manual mode: Command"/>
        </bitfield>
        <bitfield id="ENABLE" description="SPI enable" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disable module function"/>
            <bitenum id="ENABLE" value="0x1" description="Enable module function"/>
        </bitfield>
        <bitfield id="RXTIMEOUT" description="Receive Timeout (only for Peripheral mode)
Defines the number of Clock Cycles before after which the Receive Timeout flag RTOUT is set.
The time is calculated using the control register for the clock selection and divider in the Controller mode configuration.
A value of 0 disables this function." begin="29" end="24" width="6" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0x3F" description="Highest possible value"/>
        </bitfield>
        <bitfield id="CDENABLE" description="Command/Data Mode enable" begin="11" end="11" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="CS3 is used for Chip Select"/>
            <bitenum id="ENABLE" value="0x1" description="CS3 is used as CD signal"/>
        </bitfield>
        <bitfield id="PTEN" description="Parity transmit enable
If enabled, parity transmission will be done for both controller and peripheral modes." begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Parity transmission is disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Parity transmission is enabled"/>
        </bitfield>
    </register>
    <register id="SPI1_CLKCTL" width="32" offset="0x1108" description="Clock prescaler and divider register.">
        <bitfield id="SCR" description="Serial clock divider:
This is used to generate the transmit and receive bit rate of the SPI.
The SPI bit rate is
(SPI's functional clock frequency)/((SCR+1)*2).
SCR is a value from 0-1023." begin="9" end="0" width="10" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0x3FF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="DSAMPLE" description="Delayed sampling value. 
In controller mode the data on the input pin will be delayed sampled by the defined clock cycles of internal functional clock hence relaxing the setup time of input data. This setting is useful in systems where the board delays and external peripheral delays are more than the input setup time of the controller. Please refer to the datasheet for values of controller input setup time and assess what DSAMPLE value meets the requirement of the system.
Note: High values of DSAMPLE can cause HOLD time violations and must be factored in the calculations." begin="31" end="28" width="4" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xF" description="Highest possible value"/>
        </bitfield>
    </register>
    <register id="SPI1_IFLS" width="32" offset="0x110C" description="Interrupt FIFO Level Select Register">
        <bitfield id="TXIFLSEL" description="SPI Transmit Interrupt FIFO Level Select  The trigger points for the transmit interrupt are as follows:" begin="2" end="0" width="3" rwaccess="R/W">
            <bitenum id="LVL_OFF" value="0x0" description="Reserved"/>
            <bitenum id="LVL_3_4" value="0x1" description="TX FIFO &lt;= 3/4 empty"/>
            <bitenum id="LVL_1_2" value="0x2" description="TX FIFO &lt;= 1/2 empty (default)"/>
            <bitenum id="LVL_1_4" value="0x3" description="TX FIFO &lt;= 1/4 empty"/>
            <bitenum id="LVL_RES4" value="0x4" description="Reserved"/>
            <bitenum id="LVL_EMPTY" value="0x5" description="TX FIFO is empty"/>
            <bitenum id="LVL_RES6" value="0x6" description="Reserved"/>
            <bitenum id="LEVEL_1" value="0x7" description="Trigger when TX FIFO has &gt;= 1 frame free
Should be used with DMA"/>
        </bitfield>
        <bitfield id="RXIFLSEL" description="SPI Receive Interrupt FIFO Level Select  The trigger points for the receive interrupt are as follows:" begin="5" end="3" width="3" rwaccess="R/W">
            <bitenum id="LVL_OFF" value="0x0" description="Reserved"/>
            <bitenum id="LVL_1_4" value="0x1" description="RX FIFO &gt;= 1/4 full"/>
            <bitenum id="LVL_1_2" value="0x2" description="RX FIFO &gt;= 1/2 full (default)"/>
            <bitenum id="LVL_3_4" value="0x3" description="RX FIFO &gt;= 3/4 full"/>
            <bitenum id="LVL_RES4" value="0x4" description="Reserved"/>
            <bitenum id="LVL_FULL" value="0x5" description="RX FIFO is full"/>
            <bitenum id="LVL_RES6" value="0x6" description="Reserved"/>
            <bitenum id="LEVEL_1" value="0x7" description="Trigger when RX FIFO contains &gt;= 1 frame"/>
        </bitfield>
    </register>
    <register id="SPI1_STAT" width="32" offset="0x1110" description="Status Register">
        <bitfield id="TFE" description="Transmit FIFO empty." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="NOT_EMPTY" value="0x0" description="Transmit FIFO is not empty."/>
            <bitenum id="EMPTY" value="0x1" description="Transmit FIFO is empty."/>
        </bitfield>
        <bitfield id="TNF" description="Transmit FIFO not full" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="FULL" value="0x0" description="Transmit FIFO is full."/>
            <bitenum id="NOT_FULL" value="0x1" description="Transmit FIFO is not full."/>
        </bitfield>
        <bitfield id="RFE" description="Receive FIFO empty." begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="NOT_EMPTY" value="0x0" description="Receive FIFO is not empty."/>
            <bitenum id="EMPTY" value="0x1" description="Receive FIFO is empty."/>
        </bitfield>
        <bitfield id="RNF" description="Receive FIFO not full" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="FULL" value="0x0" description="Receive FIFO is full."/>
            <bitenum id="NOT_FULL" value="0x1" description="Receive FIFO is not full."/>
        </bitfield>
        <bitfield id="BUSY" description="Busy" begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="IDLE" value="0x0" description="SPI is in idle mode."/>
            <bitenum id="ACTIVE" value="0x1" description="SPI is currently transmitting and/or receiving data, or transmit FIFO is not empty."/>
        </bitfield>
    </register>
    <register id="SPI1_RXDATA" width="32" offset="0x1130" description="RXDATA Register">
        <bitfield id="DATA" description="Received Data
When PACKEN=1,two entries of the FIFO are returned as a 32-bit value. When PACKEN=0, 1 entry of FIFO is returned as 16-bit value.
As data values are removed by the receive logic from the incoming data frame, they are placed into the entry in the receive FIFO, pointed to by the current FIFO write pointer.
Received data less than 16 bits is automatically right justified in the receive buffer." begin="15" end="0" width="16" rwaccess="R">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xFFFFFFFF" description="Highest possible value"/>
        </bitfield>
    </register>
    <register id="SPI1_TXDATA" width="32" offset="0x1140" description="TXDATA Register">
        <bitfield id="DATA" description="Transmit Data

When read, last written value will be returned. If the last write to this field was a 32-bit write (with PACKEN=1), 32-bits will be returned and if the last write was a 16-bit write (PACKEN=0), those 16-bits will be returned.  

When written, one or two FIFO entries will be written depending on PACKEN value. Data values are removed from the transmit FIFO one value at a time by the transmit logic. It is loaded into the transmit serial shifter, then serially shifted out onto the TXD output pin at the programmed bit rate. 

When a data size of less than 16 bits is selected, the user must right-justify data written to the transmit FIFO. The transmit logic ignores the unused bits." begin="15" end="0" width="16" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xFFFFFFFF" description="Highest possible value"/>
        </bitfield>
    </register>

</module>